OR08-DataFeedTrade/OR08_DataFeedTrade.wsdl

<?xml version='1.0' encoding='UTF-8'?>
<wsdl:definitions name="OR08_DataFeedTrade" targetNamespace="http://oracle.com/sca/soapservice/KPEIMID/OR08-DataFeedTrade/OR08_DataFeedTrade" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:inp1="http://www.kpei.co.id/DataFeedTradeRequest" xmlns:tns="http://oracle.com/sca/soapservice/KPEIMID/OR08-DataFeedTrade/OR08_DataFeedTrade" xmlns:out1="http://kpei.co.id/MDwsReply.xsd">
   <wsdl:import namespace="http://schemas.oracle.com/bpel/extension" location="RuntimeFault.wsdl"/>
   <wsdl:types>
      <schema xmlns="http://www.w3.org/2001/XMLSchema">
         <import namespace="http://www.kpei.co.id/DataFeedTradeRequest" schemaLocation="xsd/DataFeedTrade-request.xsd"/>
      </schema>
      <schema xmlns="http://www.w3.org/2001/XMLSchema">
         <import namespace="http://kpei.co.id/MDwsReply.xsd" schemaLocation="xsd/MDwsReply.xsd"/>
      </schema>
   </wsdl:types>
   <wsdl:message name="requestMessage">
      <wsdl:part name="request" element="inp1:NettedTrade"/>
   </wsdl:message>
   <wsdl:message name="replyMessage">
      <wsdl:part name="reply" element="out1:wsReply"/>
   </wsdl:message>
   <wsdl:portType name="sendNettedTrade_ptt">
      <wsdl:operation name="OR08-sendNettedTrade">
         <wsdl:input message="tns:requestMessage"/>
         <wsdl:output message="tns:replyMessage"/>
      </wsdl:operation>
   </wsdl:portType>
</wsdl:definitions>
